modules/common/src/test/resources/com/l7tech/common/resources/dotNetSignedAndEncryptedRequest.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-b4d018cd-2ef9-43a4-980c-d208deab4d4b">http://warehouse.acme.com/ws/listProducts</wsa:Action><wsa:MessageID wsu:Id="Id-45e3fb51-f4e4-4ec5-97e3-2d8c3333cb54">uuid:915ddbca-ef1c-43ce-89db-42dd5ed75654</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-230831dc-bff3-4608-82cd-08db49fe0743"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-03f07313-9e1d-4f08-a2b7-02b5f536c99c">http://riker:8888/ACMEWarehouseWS/Service1.asmx</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-f28f8bba-426a-4aea-a7f6-d3c9143e1ceb"><wsu:Created>2004-06-21T21:00:05Z</wsu:Created><wsu:Expires>2004-06-21T21:05:05Z</wsu:Expires></wsu:Timestamp><wsse:BinarySecurityToken ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="SecurityToken-c5cc6b11-40cf-41b6-b949-a4d2115d59f4">MIIBxDCCAW6gAwIBAgIQxUSXFzWJYYtOZnmmuOMKkjANBgkqhkiG9w0BAQQFADAWMRQwEgYDVQQDEwtSb290IEFnZW5jeTAeFw0wMzA3MDgxODQ3NTlaFw0zOTEyMzEyMzU5NTlaMB8xHTAbBgNVBAMTFFdTRTJRdWlja1N0YXJ0Q2xpZW50MIGfMA0GCSqGSIb3DQEBAQUAA4GNADCBiQKBgQC+L6aB9x928noY4+0QBsXnxkQE4quJl7c3PUPdVu7k9A02hRG481XIfWhrDY5i7OEB7KGW7qFJotLLeMec/UkKUwCgv3VvJrs2nE9xO3SSWIdNzADukYh+Cxt+FUU6tUkDeqg7dqwivOXhuOTRyOI3HqbWTbumaLdc8jufz2LhaQIDAQABo0swSTBHBgNVHQEEQDA+gBAS5AktBh0dTwCNYSHcFmRjoRgwFjEUMBIGA1UEAxMLUm9vdCBBZ2VuY3mCEAY3bACqAGSKEc+41KpcNfQwDQYJKoZIhvcNAQEEBQADQQAfIbnMPVYkNNfX1tG1F+qfLhHwJdfDUZuPyRPucWF5qkh6sSdWVBY5sT/txBnVJGziyO8DPYdu2fPMER8ajJfl</wsse:BinarySecurityToken><xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5" /><KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:KeyIdentifier ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509SubjectKeyIdentifier">dWL8/RdVQ0T3fMHHTAP/zSSRPvA=</wsse:KeyIdentifier></wsse:SecurityTokenReference></KeyInfo><xenc:CipherData><xenc:CipherValue>p1ePda/kRPuGMgAo/tD545B+X3JXudAFDbzYZhBwUz9D3uzChCToQ9OFQpboNOn6az7gWSazzr6bzgg6UBdLutZpqRiebZOH2ShHAsbWt3DpnIO4F1k3WjA+XHpz+pvgnz8OeMtkQgwA64qa5kNSMPDfDrESuJ06DbZHQM4NK0g=</xenc:CipherValue></xenc:CipherData><xenc:ReferenceList><xenc:DataReference URI="#EncryptedContent-bab48746-4708-42e3-8b39-d3603caf3143" /></xenc:ReferenceList></xenc:EncryptedKey><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" /><Reference URI="#Id-b4d018cd-2ef9-43a4-980c-d208deab4d4b"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>DhwRwFYAvYbTHTG9j86De0iQJR8=</DigestValue></Reference><Reference URI="#Id-45e3fb51-f4e4-4ec5-97e3-2d8c3333cb54"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>3y8t3U1de+SlXtAUKsSjSXfBPr8=</DigestValue></Reference><Reference URI="#Id-230831dc-bff3-4608-82cd-08db49fe0743"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>qAlzzRO/aXTYuMbENaA0wt7WGDQ=</DigestValue></Reference><Reference URI="#Id-03f07313-9e1d-4f08-a2b7-02b5f536c99c"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>A2L4cVmA15c0Oa9KpBCFzHb5sZM=</DigestValue></Reference><Reference URI="#Timestamp-f28f8bba-426a-4aea-a7f6-d3c9143e1ceb"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>jO1CUtPwWYifH/TnaRo4Ox4J1r0=</DigestValue></Reference><Reference URI="#Id-71b6e541-1646-42bc-bf69-17f956505ea3"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>oka0c9a/2uA5WejXbQZY6rOp3ZQ=</DigestValue></Reference></SignedInfo><SignatureValue>Dts1MhRj4KVLDkOMNA2JyCmTHqmzoGkOKsgvrrtFNwUmtHH8ZaRdyNPAh7hHJKVtOk+K+xsWPupvg0DIMz7SxIwzSpTsCqtcMEdVqx5icLaqlR9G/0nyuJddYZn22mDRViDf9sVY85+PSGbn3kA5CDBSVrRl6W3Q7f0R8DG+f94=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-c5cc6b11-40cf-41b6-b949-a4d2115d59f4" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-71b6e541-1646-42bc-bf69-17f956505ea3"><xenc:EncryptedData Id="EncryptedContent-bab48746-4708-42e3-8b39-d3603caf3143" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" /><xenc:CipherData><xenc:CipherValue>avIVA0mYTl0EgpgeSK+mpZ0f/w3JlJwgDK7fwlpV2fBX08WcM2676fF101yfCBcpY/yHez+i76OAMmQPtaV2SOb192WSRBMTP9bFNYdhQHY=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>
